app/controllers/courses_controller.rb

  def create
    @course = current_user.courses.new(course_params)

    if @course.save
---
INSERT INTO "courses" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Test"], ["user_id", 1], ["created_at", "2018-01-14 01:16:08.144945"], ["updated_at", "2018-01-14 01:16:08.144945"]]

  def edit
    @course = Course.find(params[:id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 6]]

  def update
    @course = Course.find(params[:id])

    if @course.update(course_params)
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 6]]
UPDATE "courses" SET "end_date" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["end_date", "2018-05-29 00:00:00.000000"], ["updated_at", "2018-01-14 20:11:44.363684"], ["id", 6]]

  def destroy
    @course = Course.find(params[:id])

    if @course.destroy
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "courses" WHERE "courses"."id" = ?  [["id", 5]]