app/controllers/welcome_controller.rb

  def dashboard
    @courses = current_user.courses
    @students = Student.where(course: @courses)
---
SELECT "courses".* FROM "courses" WHERE "courses"."user_id" = ?  [["user_id", 1]]